# -*- mode: org; fill-column: 78; -*-
# Time-stamp: <2025-09-10 18:19:58 krylon>
#
#+TAGS: internals(i) ui(u) bug(b) feature(f)
#+TAGS: database(d) design(e), meditation(m)
#+TAGS: optimize(o) refactor(r) cleanup(c)
#+TODO: TODO(t)  RESEARCH(r) IMPLEMENT(i) TEST(e) | DONE(d) FAILED(f) CANCELLED(c)
#+TODO: MEDITATE(m) PLANNING(p) | SUSPENDED(s)
#+PRIORITIES: A G D

* Boring [0/0]
  :PROPERTIES:
  :COOKIE_DATA: todo recursive
  :VISIBILITY: children
  :END:
  A boring idle-clicker game
** Clocktable
   #+BEGIN: clocktable :scope file :maxlevel 255 :emphasize t
   #+CAPTION: Clock summary at [2025-09-10 Mi 18:19]
   | Headline             | Time   |        |      |
   |----------------------+--------+--------+------|
   | *Total time*         | *0:30* |        |      |
   |----------------------+--------+--------+------|
   | *Boring [0/0]*       | *0:30* |        |      |
   | \_  /Features [1/2]/ |        | /0:30/ |      |
   | \_    Persistence    |        |        | 0:30 |
   #+END:
** Features [1/2]
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY: children
   :END:
*** DONE Persistence
    CLOSED: [2025-09-10 Mi 18:19]
    :LOGBOOK:
    CLOCK: [2025-09-10 Mi 17:49]--[2025-09-10 Mi 18:19] =>  0:30
    :END:
*** TODO Reset for great price!
** Components [0/0]
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY: children
   :END:
** Bugs [0/0]
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY: children
   :END:
